app/controllers/cryptocurrencies_controller.rb

SELECT "cryptocurrencies".* FROM "cryptocurrencies" WHERE "cryptocurrencies"."wallet_id" = $1  [["wallet_id", 1]]
UPDATE "cryptocurrencies" SET "price" = $1, "updated_at" = $2 WHERE "cryptocurrencies"."id" = $3  [["price", "19789.27"], ["updated_at", "2022-09-05 10:19:01.689058"], ["id", 3]]
---
  def index
    @wallet.cryptocurrencies.each do |cryptocurrency|
      cryptocurrency.update(price: price(cryptocurrency.coingecko_id))

INSERT INTO "cryptocurrencies" ("coingecko_id", "symbol", "price", "buy_price", "quantity", "total_worth", "wallet_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    if params[:cryptocurrency][:symbol] == ""
      render json: {symbol: ["can't be blank"]}, status: :unprocessable_entity
    else
      cryptocurrency = search(params[:cryptocurrency][:symbol])
      cryptocurrency['symbol'] == (params[:cryptocurrency][:symbol])
        @cryptocurrency = @wallet.cryptocurrencies.build(
          symbol: cryptocurrency['symbol'].downcase,
          price: price(cryptocurrency['id']),
          coingecko_id: cryptocurrency['id'],
          buy_price: (params[:cryptocurrency][:buy_price]),
          quantity: (params[:cryptocurrency][:quantity])
          )
        if @cryptocurrency.save

DELETE FROM "cryptocurrencies" WHERE "cryptocurrencies"."id" = $1  [["id", 3]]
SELECT "cryptocurrencies".* FROM "cryptocurrencies" WHERE "cryptocurrencies"."symbol" = $1  [["symbol", "eth"]]
---
  def destroy
    @wallet.cryptocurrencies.where(symbol: @cryptocurrency.symbol).destroy_all

SELECT "wallets".* FROM "wallets" WHERE "wallets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_wallet
      @wallet = Wallet.find(params[:wallet_id])

SELECT "cryptocurrencies".* FROM "cryptocurrencies" WHERE "cryptocurrencies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cryptocurrencies" SET "price" = $1, "updated_at" = $2 WHERE "cryptocurrencies"."id" = $3  [["price", "19709.32"], ["updated_at", "2022-09-05 11:18:46.317219"], ["id", 3]]
---
    def set_cryptocurrency
      @cryptocurrency = Cryptocurrency.find(params[:id])
      @cryptocurrency.update(price: price(@cryptocurrency.coingecko_id))