app/controllers/cryptocurrencies_controller.rb

INSERT INTO "cryptocurrencies" ("currency", "latest_price", "quantity", "total_worth", "wallet_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    cryptocurrency = search(params[:cryptocurrency][:symbol])
    if cryptocurrency['symbol'] == (params[:cryptocurrency][:symbol])
      @cryptocurrency = @wallet.cryptocurrencies.build(
          symbol: cryptocurrency['symbol'].downcase,
          price: price(cryptocurrency['id']),
          coingecko_id: cryptocurrency['id'],
          buy_price: (params[:cryptocurrency][:buy_price]),
          quantity: (params[:cryptocurrency][:quantity])
        )
      if @cryptocurrency.save