app/controllers/cryptocurrencies_controller.rb

    def all_cryptocurrencies
      @cryptocurrencies = Cryptocurrency.where(user_id: current_user.id)
---
SELECT "cryptocurrencies".* FROM "cryptocurrencies" WHERE "cryptocurrencies"."user_id" = $1  [["user_id", 1]]

    def set_wallet
      @wallet = Wallet.find(params[:wallet_id])
---
SELECT "wallets".* FROM "wallets" WHERE "wallets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]