app/controllers/wallets_controller.rb

  def create
    @wallet = Wallet.new(wallet_params)
    @wallet.user_id = current_user.id

    if @wallet.save
---
INSERT INTO "wallets" ("overall_worth", "wallet_type", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["overall_worth", "0.0"], ["wallet_type", "MyWallet"], ["user_id", 1], ["created_at", "2022-09-01 13:02:01.521916"], ["updated_at", "2022-09-01 13:02:01.521916"]]

  def destroy
    @wallet.destroy
---
DELETE FROM "wallets" WHERE "wallets"."id" = $1  [["id", 1]]

    def set_wallet
      @wallet = Wallet.find(params[:id])
---
SELECT "wallets".* FROM "wallets" WHERE "wallets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def compute_overall_worth(wallet)
      overall_worth = 0
      wallet.cryptocurrencies.each do |cryptocurrency|
---
SELECT "cryptocurrencies".* FROM "cryptocurrencies" WHERE "cryptocurrencies"."wallet_id" = $1  [["wallet_id", 1]]

    def compute_overall_pnl(wallet)
      overall_pnl = 0
      wallet.cryptocurrencies.each do |cryptocurrency|
---
SELECT "cryptocurrencies".* FROM "cryptocurrencies" WHERE "cryptocurrencies"."wallet_id" = $1  [["wallet_id", 2]]