app/controllers/wallets_controller.rb

SELECT "wallets".* FROM "wallets" WHERE "wallets"."user_id" = $1  [["user_id", 1]]
SELECT "cryptocurrencies".* FROM "cryptocurrencies" WHERE "cryptocurrencies"."wallet_id" = $1  [["wallet_id", 2]]
UPDATE "cryptocurrencies" SET "price" = $1, "updated_at" = $2 WHERE "cryptocurrencies"."id" = $3  [["price", "18905.08"], ["updated_at", "2022-09-07 14:35:49.085753"], ["id", 15]]
UPDATE "cryptocurrencies" SET "price" = $1, "updated_at" = $2 WHERE "cryptocurrencies"."id" = $3  [["price", "0.03468123"], ["updated_at", "2022-09-08 09:44:55.802542"], ["id", 27]]
UPDATE "wallets" SET "overall_worth" = $1, "updated_at" = $2, "overall_pnl" = $3 WHERE "wallets"."id" = $4  [["overall_worth", "19227.77"], ["updated_at", "2022-09-08 09:40:57.154837"], ["overall_pnl", "-772.23"], ["id", 6]]
---
  def index
    debugger
    a = top_100
    @wallets = Wallet.where(user_id: current_user.id)
    @wallets.each do |wallet|
      wallet.cryptocurrencies.each do |cryptocurrency|
        current_price = a.select { |cc| cc["symbol"] == cryptocurrency.symbol}
        if current_price != []
          cryptocurrency.update(price: current_price.first["current_price"])
        else
          cryptocurrency.update(price: price(cryptocurrency.coingecko_id))
        end
      end
      wallet.update(overall_worth: compute_overall_worth(wallet), overall_pnl: compute_overall_pnl(wallet))

INSERT INTO "wallets" ("overall_worth", "wallet_type", "user_id", "created_at", "updated_at", "overall_pnl") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["overall_worth", "0.0"], ["wallet_type", "Ed1Wallet1"], ["user_id", 1], ["created_at", "2022-09-08 09:39:56.486627"], ["updated_at", "2022-09-08 09:39:56.486627"], ["overall_pnl", "0.0"]]
---
  def create
    @wallet = Wallet.new(wallet_params)
    @wallet.user_id = current_user.id

    if @wallet.save

UPDATE "wallets" SET "overall_worth" = $1, "updated_at" = $2 WHERE "wallets"."id" = $3  [["overall_worth", "39553.8"], ["updated_at", "2022-09-05 09:14:00.008030"], ["id", 2]]
---
  def update
    if @wallet.update(wallet_params)

DELETE FROM "wallets" WHERE "wallets"."id" = $1  [["id", 3]]
---
  def destroy
    @wallet.destroy

SELECT "wallets".* FROM "wallets" WHERE "wallets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "wallets" SET "overall_worth" = $1, "updated_at" = $2, "overall_pnl" = $3 WHERE "wallets"."id" = $4  [["overall_worth", "39338.77"], ["updated_at", "2022-09-05 11:34:28.482572"], ["overall_pnl", "-1661.23"], ["id", 2]]
---
    def set_wallet
      @wallet = Wallet.find(params[:id])
      @wallet.update(overall_worth: compute_overall_worth(@wallet), overall_pnl: compute_overall_pnl(@wallet))

SELECT "cryptocurrencies".* FROM "cryptocurrencies" WHERE "cryptocurrencies"."wallet_id" = $1  [["wallet_id", 2]]
---
    def compute_overall_worth(wallet)
      overall_worth = 0
      wallet.cryptocurrencies.each do |cryptocurrency|